###############################################################
#  Generated by:      Cadence Innovus 18.13-s088_1
#  OS:                Linux x86_64(Host ID hansolo.poly.edu)
#  Generated on:      Thu Oct 21 00:04:46 2021
#  Design:            aes
#  Command:           write_db out/post_impl_aes_70_orig.final
###############################################################
current_design aes
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}] -name VCLK -period 4.0 -waveform {0.0 2.0}
set_max_fanout 10  [get_ports {clk}]
set_max_fanout 10  [get_ports {reset_n}]
set_max_fanout 10  [get_ports {cs}]
set_max_fanout 10  [get_ports {we}]
set_max_fanout 10  [get_ports {address[7]}]
set_max_fanout 10  [get_ports {address[6]}]
set_max_fanout 10  [get_ports {address[5]}]
set_max_fanout 10  [get_ports {address[4]}]
set_max_fanout 10  [get_ports {address[3]}]
set_max_fanout 10  [get_ports {address[2]}]
set_max_fanout 10  [get_ports {address[1]}]
set_max_fanout 10  [get_ports {address[0]}]
set_max_fanout 10  [get_ports {write_data[31]}]
set_max_fanout 10  [get_ports {write_data[30]}]
set_max_fanout 10  [get_ports {write_data[29]}]
set_max_fanout 10  [get_ports {write_data[28]}]
set_max_fanout 10  [get_ports {write_data[27]}]
set_max_fanout 10  [get_ports {write_data[26]}]
set_max_fanout 10  [get_ports {write_data[25]}]
set_max_fanout 10  [get_ports {write_data[24]}]
set_max_fanout 10  [get_ports {write_data[23]}]
set_max_fanout 10  [get_ports {write_data[22]}]
set_max_fanout 10  [get_ports {write_data[21]}]
set_max_fanout 10  [get_ports {write_data[20]}]
set_max_fanout 10  [get_ports {write_data[19]}]
set_max_fanout 10  [get_ports {write_data[18]}]
set_max_fanout 10  [get_ports {write_data[17]}]
set_max_fanout 10  [get_ports {write_data[16]}]
set_max_fanout 10  [get_ports {write_data[15]}]
set_max_fanout 10  [get_ports {write_data[14]}]
set_max_fanout 10  [get_ports {write_data[13]}]
set_max_fanout 10  [get_ports {write_data[12]}]
set_max_fanout 10  [get_ports {write_data[11]}]
set_max_fanout 10  [get_ports {write_data[10]}]
set_max_fanout 10  [get_ports {write_data[9]}]
set_max_fanout 10  [get_ports {write_data[8]}]
set_max_fanout 10  [get_ports {write_data[7]}]
set_max_fanout 10  [get_ports {write_data[6]}]
set_max_fanout 10  [get_ports {write_data[5]}]
set_max_fanout 10  [get_ports {write_data[4]}]
set_max_fanout 10  [get_ports {write_data[3]}]
set_max_fanout 10  [get_ports {write_data[2]}]
set_max_fanout 10  [get_ports {write_data[1]}]
set_max_fanout 10  [get_ports {write_data[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {address[5]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[31]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[24]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[17]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {we}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[8]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[4]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {address[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[20]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[13]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[29]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {address[6]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[25]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[18]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[9]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {address[2]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[21]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[14]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[5]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[10]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {cs}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {reset_n}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {address[7]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[26]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[19]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {address[3]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[22]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[15]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[6]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[2]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[11]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[27]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {address[4]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[30]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[23]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[16]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[7]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[3]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {address[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[12]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {write_data[28]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[3]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[19]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[26]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[1]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[17]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[24]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[31]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[15]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[22]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[13]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[20]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[11]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[8]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[6]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[29]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[4]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[27]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[2]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[18]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[25]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[0]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[16]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[23]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[30]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[14]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[21]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[12]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[10]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[9]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[7]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[5]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {VCLK}] [get_ports {read_data[28]}]
